_posts/2022-10-11-learning_kotlin_resources.html
---
layout: blogpost
title: Best resources to learn Kotlin (in my view)
tags: programming kotlin books
---

<p>
Do you want to learn Kotlin? Wonder what resources you should use to learn it? In this article I collect a few different resources depending on your interests and skill level. You might pick a few, mix and match or do whatever you want that makes you learn the concepts. Only you know the way you learn things the best. Without further ado, let us dive into the resources!
</p>


<p>
<b>NOTE! When I recommend books, I use Amazon Affiliate links.</b>
</p>


<div id="outline-container-org239f125" class="outline-2">
<h2 id="org239f125">Learning the basics</h2>
<div class="outline-text-2" id="text-org239f125">
<p>
No matter your skill level, you will at some point refer to <a href="https://kotlinlang.org/docs/getting-started.html">the official language documentation</a>. For many of you, this will probably be the best place to start as well. All the examples can be run directly on the website, but you want to try your own code snippets interactively you can do it on <a href="https://play.kotlinlang.org/">play.kotlinlang.org</a>. If you already know Java, they have <a href="https://play.kotlinlang.org/koans/overview">an interactive track called Koans</a> that teach you the basics of Kotlin. This program help you get familiar with the syntax and workings of the language.
</p>

<p>
There is probably two groups of people who end up reading this blog post; people new to programming in general, and people who know some programming and want to learn Kotlin. My recommendations are a bit different depending on which group you belong to. You may mix and match, but complete beginners will have a harder road with the resources aimed at people familiar with programming and/or the Java/JVM ecosystem.
</p>
<ul class="org-ul">
<li><b>Complete beginner</b>: If you are set on learning Kotlin as a beginner, I think I would start with the <a href="https://amzn.to/3COBGe0">Head First Kotlin book</a>. It covers several programming concepts, and teaches you Kotlin from the ground up. It claims you should have some very basic scripting experience, but I think it is achievable with some effort (maybe supplement the official documentation above?). <a href="https://www.jetbrains.com/academy/">JetBrains Academy</a> might be worth checking out, but I don't know too much about it. They describe their approach in <a href="https://www.youtube.com/watch?v=wBbYU7bcKHQ">this YouTube video</a>.</li>
<li><b>Familiar with programming and/or the Java/JVM ecosystem:</b> The absolute BEST book on Kotlin in my view is <a href="https://amzn.to/3VeH41v">Programming Kotlin by Venkat Subramaniam</a>! It goes through the basics, as well as some examples using Spring and also creating Android applications. Several often ignored parts of the Kotlin syntax is covered, and even I learned something new when reading it a few years ago (I had programmed in Kotlin for almost a year by that point). It requires that you know the basics of programming, and also assumes that you know about the Java ecosystem, but it is manageable in my view. I know someone who have read it and only knew some C programming, and they were able to start programming Kotlin after reading at least parts of the book! One exercise those of you who are more experienced may find useful is to refactor one of your Java applications to Kotlin.</li>
</ul>


<p>
If you want to edit your files locally, you will also need an editor of some kind. Kotlin is created by JetBrains, the creators of IntelliJ IDEA. I would say that most people end up using <a href="https://www.jetbrains.com/idea/">IntelliJ IDEA</a> for Kotlin, as they find it has the most complete tool support for the language. Other people, like myself, have a <b>very</b> strong preference for other editors like Emacs. On this blog you will find several articles about Kotlin in Emacs, <a href="https://themkat.net/2022/09/24/kotlin_in_emacs_redux.html">one recent</a> and <a href="https://themkat.net/2021/11/03/kotlin_in_emacs.html">one older</a>. The details mentioned in those articles can probably help you configure Kotlin IDE functionality in other editors, like Vim, as well.
</p>
</div>
</div>


<div id="outline-container-org3201174" class="outline-2">
<h2 id="org3201174">Next steps</h2>
<div class="outline-text-2" id="text-org3201174">
<p>
So you know the basics now, and want to keep on learning new concepts. The play.kotlinlang.org site have <a href="https://play.kotlinlang.org/hands-on/overview">lots of hands-on labs you can try</a>, even though most of them probably are meant a bit for intermediates. If you want to learn a specific concept, like Native, Multiplatform, Spring Boot etc., then they might be worth a try. To stay up to date with Kotlin, Jetbrains has <a href="https://www.youtube.com/c/Kotlin">an excellent YouTube channel</a> with talks, news about new features and more. There are several videos on their channel, ranging from basic concepts to more advanced topics:
</p>
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=n4WBip822A8&amp;list=PLlFc5cFwUnmy6Fz9aq-JMlzk34ce5hJrg&amp;index=5">Kotlin Standard Library safari</a>: Tips on using the standard library and often overlooked parts of it.</li>
<li><a href="https://www.youtube.com/watch?v=i-kyPp1qFBA&amp;list=PLlFc5cFwUnmyDrc-mwwAL9cYFkSHoHHz7">Evergreen Kotlin tips</a> (usage of the Elvis operator, fully qualified names, nullability etc.)</li>
<li>If you use Spring, or want to, then the <a href="https://www.youtube.com/watch?v=ihMhu3hvCCE&amp;list=PLlFc5cFwUnmxOJL0GSSZ1Vot4KL2Vwe7x">Spring Time in Kotlin series</a> is worth a watch. At least the videos containing what you are interested in. They cover reactive programming, coroutines and more.</li>
<li>Some of you learn by seeing other people solve programming problems, like <a href="https://www.youtube.com/watch?v=abkHxIMJGIw">this interview problem</a>.</li>
</ul>



<p>
There are also some resources you can check out based upon other topics:
</p>
<ul class="org-ul">
<li><b>Android development</b>: Google announced first-class support for Kotlin in 2017, replacing Java. <a href="https://developer.android.com/kotlin">Development is covered extensively in its documentation</a>, including toolkits like Jetpack Compose that makes Android development more comfortable.</li>
<li><b>Compiling to native code (iOS, Linux, Windows, etc.):</b> Want to interface with C libraries? Or make native applications for phones like iPhone? Then <a href="https://kotlinlang.org/docs/native-overview.html">Kotlin Native</a> is probably for you.</li>
<li><b>Multiplatform codebases</b>: This potentially combines the previous point with Android development, server side apps, frontend apps and more. <a href="https://kotlinlang.org/docs/native-overview.html">Multiplatform projects</a> help you share code between several targets. This can help you make applications for Android and iOS, fullstack web apps and more! I'm not very familiar with this, but it seems interesting.</li>
<li><b>Kotlin for scripting</b>: Want to replace clunky big bash scripts with Kotlin code? Or maybe you just prefer automating with Kotlin instead of Python or NodeJS? <a href="https://github.com/kscripting/kscript">KScript</a> makes this easy!</li>
<li><b>Domain specific languages in Kotlin</b>: I mentioned Venkat Subramaniam earlier, and he have written <a href="https://amzn.to/3fSlTSp">a book about domain specific languages in Kotlin</a>. Might be worth checking out if you find the concept of domain specific languages useful. There is also <a href="https://themkat.net/2020/08/27/kotlin_dsl.html">an article on this blog</a> about that topic.</li>
<li><b>Kotlin syntax and features you may have forgotten?</b> There is <a href="https://themkat.net/2022/01/16/kotlin_often_forgotten_features.html">an article on this blog</a> for that!</li>
</ul>


<p>
Enjoy listening to podcasts? There is actually a podcast about Kotlin where they talk about libraries, approaches at companies etc. It's called <a href="https://talkingkotlin.com/">Talking Kotlin</a>, and is available where you usually listen to podcasts.
</p>


<p>
If you want to do software development professionally, I wrote <a href="https://themkat.net/2020/09/07/career_boosting_books.html">an article with book recommendations for that</a> a few years ago. It has a slight focus on the Java ecosystem, but many of the books are useful either way.
</p>
</div>
</div>
